#Упражнение 63. Среднее значение
#В данном упражнении вы должны написать программу для подсчета
#среднего значения всех введенных пользователем чисел. Индикатором
#окончания ввода будет служить ноль. При этом программа должна выда-
#вать соответствующее сообщение об ошибке, если первым же введенным
#пользователем значением будет ноль.
#Подсказка. Поскольку ноль является индикатором окончания ввода, его не нужно
#учитывать при расчете среднего.

number=float(input("Enter a number (0 to exit)"))
sum=0
quantity=0
while number !=0:
    sum=sum+number
    quantity=quantity+1
    number=float(input("Enter a number (0 to exit)"))
average=sum/quantity
print(average)
