#Упражнение 65. Таблица соотношения температур
#Напишите программу для вывода таблицы соотношения температур, вы-
#раженных в градусах Цельсия и Фаренгейта. В таблице должны разме-
#щаться все температуры между 0 и 100 градусами Цельсия, кратные 10.
#Дополните таблицу подходящими заголовками. Формулу для перевода
#температуры из градусов Цельсия в градусы Фаренгейта можно легко
#найти на просторах интернета.

temp_list=range(0,101,10)
for i in temp_list:
    temp_F=i*1.8+32
    print(f'{i}°C is {temp_F}°F')