#Упражнение 67. Найти периметр многоугольника
#Напишите программу для расчета периметра заданного многоугольника.
#Начните с запроса у пользователя координат x и y первой точки много-
#угольника. Продолжайте запрашивать координаты следующих точек фи-
#гуры, пока пользователь не оставит строку ввода координаты по оси x
#пустой. После ввода каждой пары значений вы должны вычислить длину
#очередной стороны многоугольника и прибавить полученное значение
#к будущему ответу. По окончании ввода необходимо вычислить расстоя­
#ние от последней введенной точки до первой, чтобы замкнуть фигуру,
#и вывести итоговый результат.

x_prev=input("X is ...")
y_prev=input("Y is ...")
x=input("X is ...")
y=input("Y is ...")
sum=0
while x!="":
    length=((float(x)-float(x_prev))**2+(float(y)-float(y_prev))**2)**0.5
    sum=sum+length
    x_prev=x
    y_prev=y
    x=input("X is ...")
    y=input("Y is ...")
print("Perimeter is", sum)